In [1]:
'''Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.'''
import pandas as pd
data=[ 4, 8, 15, 16, 23, 42]
df1=pd.Series(data)
print(df1)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [2]:
'''Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.'''
import pandas as pd
list=[ i for i in range(30,41)]
df2=pd.Series(list)
print(df2)

0     30
1     31
2     32
3     33
4     34
5     35
6     36
7     37
8     38
9     39
10    40
dtype: int64

In [3]:
'''Q3. Create a Pandas DataFrame that contains the following data:

Then, print the DataFrame.'''

dict3={'Name':['Alica','Bob','Claire'],
      'Age':[25,30,27],
      'Gender':['Female','Male','Female']}
df3=pd.DataFrame(dict3)
df3

     Name  Age  Gender
0   Alica   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [4]:
# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
'''
dataframe in pandas is 2 dimension, heterogenous data and 2D labelled array which is data and size mutable in nature 
while Series in pandas is one dimensions, homogeneous and labelled array which is size immatable and data mutable
'''

'\ndataframe in pandas is 2 dimension, heterogenous data and 2D labelled array which is data and size mutable in nature \nwhile Series in pandas is one dimensions, homogeneous and labelled array which is size immatable and data mutable\n'

In [1]:
'''Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

There are various functions used with dataframe of pandas to manipulate the data.Spme of them are mentioned below:- 
pipe(),apply(),applyall(),df.dtype, df.ndim, df.empty, df.size, df.values, pf.head(n), df.tail(n) 
'''

# example as code
import pandas as pd

def adder(ele1,ele2):
   return ele1+ele2

df = pd.DataFrame([[10,21,44],[42,55,78],[74,83,64,]],columns=['col1','col2','col3'])
df

   col1  col2  col3
0    10    21    44
1    42    55    78
2    74    83    64

In [3]:
df.pipe(adder,2)

   col1  col2  col3
0    12    23    46
1    44    57    80
2    76    85    66

In [12]:
def sq(x):
    return x**2
df['col1'].apply(sq)

0     100
1    1764
2    5476
Name: col1, dtype: int64

In [5]:
df.applymap(lambda x: x*100)

   col1  col2  col3
0  1000  2100  4400
1  4200  5500  7800
2  7400  8300  6400

In [13]:
df.sort_values('col1')

   col1  col2  col3
0    10    21    44
1    42    55    78
2    74    83    64

In [6]:
'''Q6. Which of the following is mutable in nature Series, DataFrame, Panel?'''
'''
Answer:-
series is size immutable but values of data mutable
DataFrame is both size mutable and values of data mutable
Panel is size and data mutable
'''

'\nAnswer:-\nseries is size immutable but values of data mutable\nDataFrame is both size mutable and values of data mutable\nPanel is size and data mutable\n'

In [7]:
'''Q7. Create a DataFrame using multiple Series. Explain with an example.'''

s1_name=pd.Series(['Mona','Lisa','Xidene','Klevien','Clavien'])
s2_age=pd.Series([23,44,45,23,44])
df_info=pd.DataFrame({
    'Name':s1_name,
    'Age':s2_age
})
df_info

      Name  Age
0     Mona   23
1     Lisa   44
2   Xidene   45
3  Klevien   23
4  Clavien   44